DuyTrandeLion/ble-terrarium/Project-nRF52840/Core/Middleware/Services/ble_ess.h
/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess                     Environmental Sensing Service structure.
 * @param[in]   apparent_wind_direction   New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle               Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_apparent_wind_direction_update(ble_ess_t * p_ess,
                                                  uint16_t    apparent_wind_direction,
                                                  uint16_t    conn_handle);

/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess                 Environmental Sensing Service structure.
 * @param[in]   apparent_wind_speed   New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle           Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_apparent_wind_speed_update(ble_ess_t * p_ess,
                                              uint16_t    apparent_wind_speed,
                                              uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   dew_point       New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_dew_point_update(ble_ess_t * p_ess,
                                    int8_t      dew_point,
                                    uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   elevation       New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_elevation_update(ble_ess_t * p_ess,
                                    int32_t     elevation,
                                    uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   gust_factor     New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_gust_factor_update(ble_ess_t * p_ess,
                                      uint8_t     gust_factor,
                                      uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   heat_index      New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_heat_index_update(ble_ess_t * p_ess,
                                     int8_t      heat_index,
                                     uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   humidity        New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_humidity_update(ble_ess_t * p_ess,
                                   uint16_t    humidity,
                                   uint16_t    conn_handle);


