DuyTrandeLion/ble-terrarium/Project-nRF52840/Core/Middleware/Services/ble_ess.h
/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   irradiance      New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_irradiance_update(ble_ess_t * p_ess,
                                     uint16_t    irradiance,
                                     uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess                 Environmental Sensing Service structure.
 * @param[in]   pollen_concentration  New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle           Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_pollen_concentration_update(ble_ess_t * p_ess,
                                               uint32_t    pollen_concentration,
                                               uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   rainfall        New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_rainfall_update(ble_ess_t * p_ess,
                                   uint16_t    rainfall,
                                   uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   pressure        New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_pressure_update(ble_ess_t * p_ess,
                                   uint32_t    pressure,
                                   uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   temperature     New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_temperature_update(ble_ess_t * p_ess,
                                      int16_t     temperature,
                                      uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess                 Environmental Sensing Service structure.
 * @param[in]   true_wind_direction   New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle           Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_true_wind_direction_update(ble_ess_t * p_ess,
                                              uint16_t    true_wind_direction,
                                              uint16_t    conn_handle);

/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess             Environmental Sensing Service structure.
 * @param[in]   true_wind_speed   New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle       Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_true_wind_speed_update(ble_ess_t * p_ess,
                                          uint16_t    true_wind_speed,
                                          uint16_t    conn_handle);


