DuyTrandeLion/ble-terrarium/Project-nRF52840/Core/Middleware/Services/ble_ess.h
/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   uv_index        New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_uv_index_update(ble_ess_t * p_ess,
                                   uint8_t     uv_index,
                                   uint16_t    conn_handle);

                                             
/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   wind_chill      New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_wind_chill_update(ble_ess_t * p_ess,
                                     int8_t      wind_chill,
                                     uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess                       Environmental Sensing Service structure.
 * @param[in]   barometric_pressure_trend   New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle                 Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_barometric_pressure_trend_update(ble_ess_t * p_ess,
                                                    uint8_t     barometric_pressure_trend,
                                                    uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess                 Environmental Sensing Service structure.
 * @param[in]   magnetic_declination  New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle           Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_magnetic_declination_update(ble_ess_t * p_ess,
                                               uint16_t    magnetic_declination,
                                               uint16_t    conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   mdf2d           New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_mfd2d_update(ble_ess_t                  * p_ess,
                                magnetic_flux_density_2d_t   mdf2d,
                                uint16_t                     conn_handle);


/**@brief Function for updating the battery level.
 *
 * @details The application calls this function after having performed a battery measurement.
 *          The battery level characteristic will only be sent to the clients which have
 *          enabled notifications. \ref BLE_CONN_HANDLE_ALL can be used as a connection handle
 *          to send notifications to all connected devices.
 *
 * @param[in]   p_ess           Environmental Sensing Service structure.
 * @param[in]   mdf3d           New battery measurement value (in percent of full capacity).
 * @param[in]   conn_handle     Connection handle.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
ret_code_t ble_ess_mfd3d_update(ble_ess_t                  * p_ess,
                                magnetic_flux_density_3d_t   mdf3d,
                                uint16_t                     conn_handle);


/**@brief Function for handling the Application's BLE Stack events.
 *
 * @details Handles all events from the BLE stack of interest to the Environmental Sensing Service.
 *
 * @param[in]   p_ble_evt   Event received from the BLE stack.
 * @param[in]   p_context   Environmental Sensing Service structure.
 */
void ble_ess_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context);


#ifdef __cplusplus
}
#endif

#endif // BLE_ESS_H__
